columns_name_macroeconomics = {'Обменный курс, руб/дол': 'exchange_rate',
                               'Таможенная пошлина на нефть из России, дол/тонна': 'customs_duty',
                               'Базовая ставка НДПИ на нефть, руб/т': 'base_rate_MET',
                               'Коэффициент Кман для расчета НДПИ и акциза, руб/т': 'K_man',
                               'КАБДТ с учетом НБУГ и НДФО для расчета НДПИ на нефть, руб/т': 'K_dt',
                               'Netback УУН Холмогоры - FOB Новороссийск, руб/тн (с учетом дисконта Трейдингу)': 'Netback',
                               'Urals (средний), дол/бар': 'Urals',
                               'Транспортные расходы для лицензионных участков III-IV группы НДД:'
                               ' поставка УУН Холмогоры - FOB Новороссийск, руб./т': 'cost_transportation'}

columns_name_business_plan = {'Доллар США': 'exchange_rate',
                              'Urals для расчета налогов': 'Urals',
                              'Нетбэк нефти для  Хантоса, СПД, Томскнефти, Мегиона, ГПН-Востока, Пальян, Толедо': 'Netback',
                              'Экспортная пошлина на нефть': 'customs_duty',
                              'Коэффициент Кман для расчета НДПИ и акциза, руб./т': 'K_man',
                              'КАБДТ с учетом НБУГ для расчета НДПИ на нефть, руб./т': 'K_dt',
                              'Базовая ставка НДПИ на нефть, руб/т': 'base_rate_MET',
                              'Транспортные расходы для м/р районов сдачи нефти (т.е. региона РФ, где расположен СИКН, '
                              'на который сдается нефть с данного м/р) - Республики Башкортостан, Республики Коми, '
                              'Удмуртской Республики, Пермского края, Тюменской области, Ненецкого автономного округа, '
                              'Ханты-Мансийского автономного округа - Югры; Ямало-Ненецкого автономного округа '
                              '(для участков недр, расположенных полностью или частично севернее 65 градуса северной широты, '
                              'южнее 70 градуса северной широты и западнее 80 градуса восточной долготы в границах '
                              'Ямало-Ненецкого автономного округа) за исключением м/р, приведенных ниже': 'cost_transportation',
                              'Ставка дисконтирования по Группе ГПН реальная': 'r'}

name_columns_FPA = "A:D, F, H, I:K, N:P, AM:AS, BA, BB, BD, BG, CG, DL, JW"
